In [36]:
import pandas as pd
import mysql.connector

In [37]:
db = mysql.connector.connect(
    host = 'localhost',
    port = '3306',
    user = 'root',
    passwd = '',
    database = 'db'
)

cursor = db.cursor()

In [16]:
nome = input('Digite seu nome : ')
sobrenome = input('Digite seu sobrenome : ')
idade = input('Digite sua idade : ')

Digite seu nome : Miguel
Digite seu sobrenome : Souza
Digite sua idade : 8

In [8]:
comando_mysql = f'INSERT INTO try (Nome, Sobrenome, Idade) VALUES (%s, %s, %s)'
registra_pessoa = (str('Nome'), str('Sobrenome'), str('Idade'))

cursor.execute(comando_mysql, registra_pessoa)
db.commit()

In [10]:
for c in banco:
    print(c)

('Guilherme ', 'Thomaz', 15)
('Andre Filho', 'Schmidt', 21)
('Paulo Júnior', 'Gearhdt', 53)
('Julia', 'Maria', 25)
('Flora', 'Maria', 4)
('Miguel', 'Souza', 8)
('Augusto', 'Seixas', 33)
('Nome', 'Sobrenome', 0)
('Nome', 'Sobrenome', 0)

In [11]:
cursor.fetchmany()

[]

In [38]:
comando_mysql = f'SELECT *FROM try'
cursor.execute(comando_mysql)

banco = cursor.fetchall()

df = pd.read_sql('SELECT * FROM try', con = db)
#df = pd.DataFrame(banco)

In [20]:
df # df = pd.DataFrame(banco)

              0          1   2
0    Guilherme      Thomaz  15
1   Andre Filho    Schmidt  21
2  Paulo Júnior    Gearhdt  53
3         Julia      Maria  25
4         Flora      Maria   4
5        Miguel      Souza   8
6       Augusto     Seixas  33
7          Nome  Sobrenome   0
8          Nome  Sobrenome   0

In [29]:
df #df = pd.read_sql('SELECT * FROM try', con = db)

           Nome  Sobrenome  Idade
0    Guilherme      Thomaz     15
1   Andre Filho    Schmidt     21
2  Paulo Júnior    Gearhdt     53
3         Julia      Maria     25
4         Flora      Maria      4
5        Miguel      Souza      8
6       Augusto     Seixas     33
7          Nome  Sobrenome      0
8          Nome  Sobrenome      0

In [30]:
list(df.columns)

['Nome', 'Sobrenome', 'Idade']

In [33]:
df.to_excel('try.xlsx')

In [47]:
df.to_csv('try_02.csv', encoding = 'utf-8', sep = ';')

In [48]:
df

           Nome  Sobrenome  Idade
0    Guilherme      Thomaz     15
1   Andre Filho    Schmidt     21
2  Paulo Júnior    Gearhdt     53
3         Julia      Maria     25
4         Flora      Maria      4
5        Miguel      Souza      8
6       Augusto     Seixas     33
7          Nome  Sobrenome      0
8          Nome  Sobrenome      0